# Parameter Type Id Toposolid Subdivide Height Property

Source: https://www.revitapidocs.com/2026/4a53f89e-d45e-f9ee-c033-27b1f7ff669e.htm

---

| Parameter Type Id Toposolid Subdivide Height Property |
| --- |

"Sub\-divide Offset"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ToposolidSubdivideHeight { get; }
```

```
Public Shared ReadOnly Property ToposolidSubdivideHeight As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ToposolidSubdivideHeight {
	ForgeTypeId^ get ();
}
```

```
static member ToposolidSubdivideHeight : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace